In [1]:
import pymysql.cursors
import pandas as pd
import datetime
import uuid
import numpy as np
from itertools import combinations

In [2]:

# Connect to the database
db_connection = pymysql.connect(host='143.198.177.53',
                             user='testUser',
                             password='testUser123@!@!',
                             db='employees',
                             charset='utf8mb4',
                             cursorclass=pymysql.cursors.DictCursor)

In [5]:
qry = "SELECT * FROM employees LIMIT 50;"
employees = pd.read_sql(qry, con=db_connection)
employees.head()

   emp_no  birth_date first_name   last_name gender   hire_date
0       1  1977-10-10    Dmitriy  Babichenko      M  2022-02-22
1       2  1960-01-01        Bob       Smith      M  2022-02-22
2       3  1996-09-13    Jiaquan       Jiang      M  2021-01-01
3       4  1997-01-01        Tom        Bill      M  2020-01-01
4   10001  1953-09-02     Georgi     Facello      M  1986-06-26

In [6]:
employees.shape

(50, 6)

In [8]:
for idx, row in employees.iterrows():
    pd.DataFrame(row).to_csv('employee_' + str(idx)+'.csv')